app/Http/Controllers/User/FrontendController.php

    public function index()
    {
        $data = [
            'top_jobs' => \App\Helper\Helpers\Helper::topJobs(),
            'hot_jobs' => \App\Helper\Helpers\Helper::hotJobs(),
            'recent_jobs' => \App\Helper\Helpers\Helper::recentJobs(),
            'general_jobs' => \App\Helper\Helpers\Helper::generalJobs(),
            'newspaper_jobs' => \App\Helper\Helpers\Helper::newspaperJobs(),
            'categories' => CompanyCategory::with('jobs')->where('status', 'active')->orderBy('order_no')->get(),
            'employers' => Employer::with('jobs')->where('status', 'active')->orderBy('order_no')->get(),
            'locations' => City::with('jobs')->where('status', 'active')->orderBy('order_no')->get(),
            'skills' => Skill::with('jobs')->where('status', 'active')->orderBy('order_no')->get(),
            'educations' => Education::where('status', 'active')->with('job')->orderBy('order_no')->get(),
            'industries' => Industry::where('status', 'active')->orderBy('order_no')->with(['jobs', 'employers.jobs'])->get(),
---
select * from `company_categories` where `status` = 'active' order by `order_no` asc
select * from `employers` where `status` = 'active' order by `order_no` asc
select * from `cities` where `status` = 'active' order by `order_no` asc
select `skills`.*, `job_skill`.`job_id` as `pivot_job_id`, `job_skill`.`skill_id` as `pivot_skill_id` from `skills` inner join `job_skill` on `skills`.`id` = `job_skill`.`skill_id` where `job_skill`.`job_id` in (179, 186, 187, 188, 192, 193, 194, 195, 196, 197)
select * from `educations` where `status` = 'active' order by `order_no` asc
select * from `employers` where `employers`.`id` in (81, 82, 83, 85, 86, 87)
select * from `industries` where `status` = 'active' order by `order_no` asc

    public function jobs(Request $request)
    {
        if (@$request->q) {
            $data['jobs'] = match ($request->q) {
                'megajobs' => \App\Helper\Helpers\Helper::topJobs(1, @$request->latest ? 'latest' : 'old'),
                'premium-jobs' =>\App\Helper\Helpers\Helper::hotJobs(1, @$request->latest ? 'latest' : 'old'),
                null => $this->getJobs($request),
                default => $this->getJobs($request)

            };
        } else {
            $data['jobs'] = $this->getJobs($request);
        }
        $data['locations'] = City::where('status', 'active')->orderBy('order_no')->get();
        $data['educations'] = Education::where('status', 'active')->orderBy('order_no')->get();
        $data['experiences'] = Experience::where('status', 'active')->orderBy('order_no')->get();
        $data['industries'] = Industry::where('status', 'active')->orderBy('order_no')->get();
        $data['departments'] = CompanyCategory::where('status', 'active')->orderBy('order_no')->get();
---
select * from `cities` where `status` = 'active' order by `order_no` asc
select * from `educations` where `status` = 'active' order by `order_no` asc
select * from `experiences` where `status` = 'active' order by `order_no` asc
select * from `industries` where `status` = 'active' order by `order_no` asc
select * from `company_categories` where `status` = 'active' order by `order_no` asc