app/Http/Controllers/User/Dashboard/SeekerProfileController.php

select * from `educations` where `status` = 'active' order by `order_no` asc
select * from `job_seeker_education` where `user_id` = 95 limit 1
select * from `study_fields` where `status` = 'active' order by `order_no` asc
---
    public function education()
    {

        $data = [
            'education' => Education::where('status', 'active')->orderBy('order_no')->get(),
            'check_education_info' => JobSeekerEducation::where('user_id', $this->user_id ?? auth()->user()->id)->first(),
            'study_field' => StudyField::where('status', 'active')->orderBy('order_no')->get(),
        ];