app/Helper/Helpers.php

select * from `employers` where `employers`.`id` in (81, 82, 83, 85, 86, 87)
---
                    break;

                case 3:
                    $jobs = Job::where('status', 'active')
                        ->latest()
                        ->with('employer')
                        ->limit(15)
                        ->get();

select * from `employers` where `employers`.`id` in (83)
---
    public static function generalJobs()
    {
        $jobs = Job::where([
            'approval' => 'approved',
            'status' => 'active',
            'type' => 'prime',
        ])->with('employer')->limit(15)->get();

select * from `employers` where `employers`.`id` in (81, 87)
---
                    break;

                case 3:
                    $jobs = Job::where('status', 'active')
                        ->where('job_type', 1)
                        ->with('employer')
                        ->latest()
                        ->limit(15)
                        ->get();