app/Providers/AppServiceProvider.php

select * from `site_settings` where `site_settings`.`id` = 1 limit 1
---
    public function boot()
    {
        // if ($_SERVER['SERVER_NAME'] != '127.0.0.1') {
        //     URL::forceScheme('https');
        // }

        $jobChecker = new CheckJobExpiry;
        $jobChecker->check();

        View::composer('*', function ($view) {
            $setting = SiteSetting::findOrFail(1);