app/Http/Controllers/Admin/AdvertisementController.php

select * from `advertisements` order by `order_no` asc
---
    public function index()
    {
        $advertisement = Advertisement::orderBy('order_no')->get();