app/Http/Controllers/Admin/DashboardController.php

        $data['employers'] = User::where('admin', 0)->role('employer')->count();
        $data['jobSeekers'] = User::where('admin', 0)->role('job-seeker')->count();

        $data['companies'] = \App\Models\Employer::withCount('jobs')->with('user')->orderBy('jobs_count', 'desc')->limit(10)->get();
---
select * from `users` where `users`.`id` in (36, 56, 62, 66, 71, 73, 82, 84)

                    'status' => 'active',
                ])->with('employer')->latest()->limit(10)->get();

        $data['JobIndustries'] = Industry::where('status', 'active')->orderBy('order_no')->with('jobs')->get();
---
select * from `industries` where `status` = 'active' order by `order_no` asc