app/Http/Controllers/Admin/EmployerController.php

select * from `employers` order by `order_no` asc
select * from `countries` where `status` = 'active' order by `order_no` asc
select * from `provinces` where `status` = 'active' order by `order_no` asc
select * from `districts` where `status` = 'active' order by `order_no` asc
select * from `cities` where `status` = 'active' order by `order_no` asc
select * from `company_categories` where `status` = 'active' order by `order_no` asc
select * from `company_owner_ships` where `status` = 'active' order by `order_no` asc
select * from `company_sizes` where `status` = 'active' order by `order_no` asc
---
    public function index()
    {
        $employers = Employer::orderBy('order_no')->get();
        $status = 'index';
        $country = Country::where('status', 'active')->orderBy('order_no')->get();
        $province = Province::where('status', 'active')->orderBy('order_no')->get();
        $district = District::where('status', 'active')->orderBy('order_no')->get();
        $city = City::where('status', 'active')->orderBy('order_no')->get();
        $company_category = CompanyCategory::where('status', 'active')->orderBy('order_no')->get();
        $company_owner_ship = CompanyOwnerShip::where('status', 'active')->orderBy('order_no')->get();
        $company_size = CompanySize::where('status', 'active')->orderBy('order_no')->get();

select * from `employers` where `employers`.`id` = '33' limit 1
select * from `countries` where `status` = 'active' order by `order_no` asc
select * from `provinces` where `status` = 'active' order by `order_no` asc
select * from `districts` where `status` = 'active' order by `order_no` asc
select * from `cities` where `status` = 'active' order by `order_no` asc
select * from `company_categories` where `status` = 'active' order by `order_no` asc
select * from `company_owner_ships` where `status` = 'active' order by `order_no` asc
select * from `company_sizes` where `status` = 'active' order by `order_no` asc
---
    public function edit($id)
    {
        $employer = Employer::findOrFail(base64_decode($id));
        $country = Country::where('status', 'active')->orderBy('order_no')->get();
        $province = Province::where('status', 'active')->orderBy('order_no')->get();
        $district = District::where('status', 'active')->orderBy('order_no')->get();
        $city = City::where('status', 'active')->orderBy('order_no')->get();
        $company_category = CompanyCategory::where('status', 'active')->orderBy('order_no')->get();
        $company_owner_ship = CompanyOwnerShip::where('status', 'active')->orderBy('order_no')->get();
        $company_size = CompanySize::where('status', 'active')->orderBy('order_no')->get();