app/Http/Controllers/Admin/JobController.php

select * from `employers` where `employers`.`id` in (33, 50, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 67, 68, 69, 70, 71)
select `users`.*, `user_applies_jobs`.`job_id` as `pivot_job_id`, `user_applies_jobs`.`user_id` as `pivot_user_id`, `user_applies_jobs`.`status` as `pivot_status` from `users` inner join `user_applies_jobs` on `users`.`id` = `user_applies_jobs`.`user_id` where `user_applies_jobs`.`job_id` in (98, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 151, 152)
select * from `countries` where `status` = 'active' order by `order_no` asc
select * from `company_categories` where `status` = 'active' order by `order_no` asc
select * from `company_owner_ships` where `status` = 'active' order by `order_no` asc
select * from `company_sizes` where `status` = 'active' order by `order_no` asc
select * from `employers` where `status` = 'active' order by `order_no` asc
select * from `job_levels` where `status` = 'active' order by `order_no` asc
select * from `educations` where `status` = 'active' order by `order_no` asc
select * from `experiences` where `status` = 'active' order by `order_no` asc
select * from `vehicles` where `status` = 'active' order by `order_no` asc
select * from `employee_types` where `status` = 'active' order by `order_no` asc
select * from `skills` where `status` = 'active' order by `order_no` asc
---
    public function index()
    {
        $jobs = Job::with(['applied_users', 'employer'])->orderBy('title')->get();
        $status = 'index';
        $country = Country::where('status', 'active')->orderBy('order_no')->get();
        $company_category = CompanyCategory::where('status', 'active')->orderBy('order_no')->get();
        $company_owner_ship = CompanyOwnerShip::where('status', 'active')->orderBy('order_no')->get();
        $company_size = CompanySize::where('status', 'active')->orderBy('order_no')->get();
        $user = User::where('email', '!=', 'ktmrushservices@gmail.com')->role('employer')->orWhere('admin',1)->get();
        $employers = Employer::where('status', 'active')->orderBy('order_no')->get();
        $job_level = JobLevel::where('status', 'active')->orderBy('order_no')->get();
        $education = Education::where('status', 'active')->orderBy('order_no')->get();
        $experience = Experience::where('status', 'active')->orderBy('order_no')->get();
        $vehicle = Vehicle::where('status', 'active')->orderBy('order_no')->get();
        $employeeType = EmployeeType::where('status', 'active')->orderBy('order_no')->get();
        $skill = Skill::where('status', 'active')->orderBy('order_no')->get();

select * from `countries` where `status` = 'active' order by `order_no` asc
select * from `company_categories` where `status` = 'active' order by `order_no` asc
select * from `company_owner_ships` where `status` = 'active' order by `order_no` asc
select * from `company_sizes` where `status` = 'active' order by `order_no` asc
select * from `employers` where `status` = 'active' order by `order_no` asc
select * from `job_levels` where `status` = 'active' order by `order_no` asc
select * from `educations` where `status` = 'active' order by `order_no` asc
select * from `experiences` where `status` = 'active' order by `order_no` asc
select * from `vehicles` where `status` = 'active' order by `order_no` asc
select * from `job_skill` where `job_id` = 152
select * from `provinces` where `status` = 'active' order by `order_no` asc
select * from `districts` where `status` = 'active' order by `order_no` asc
select * from `cities` where `status` = 'active' order by `order_no` asc
select * from `licenses` where `job_id` = 152
select * from `employee_types` where `status` = 'active' order by `order_no` asc
select * from `skills` where `status` = 'active' order by `order_no` asc
---
    public function edit($id)
    {
        $job = job::find(base64_decode($id));
        if (is_null($job) || empty($job)) {
            return redirect()->back()->with('error', 'Job was not found');
        }
        $country = Country::where('status', 'active')->orderBy('order_no')->get();
        $company_category = CompanyCategory::where('status', 'active')->orderBy('order_no')->get();
        $company_owner_ship = CompanyOwnerShip::where('status', 'active')->orderBy('order_no')->get();
        $company_size = CompanySize::where('status', 'active')->orderBy('order_no')->get();
        $user = User::where('email', '!=', 'ktmrushservices@gmail.com')->role('employer')->orWhere('admin',1)->get();
        $employers = Employer::where('status', 'active')->orderBy('order_no')->get();
        $job_level = JobLevel::where('status', 'active')->orderBy('order_no')->get();
        $education = Education::where('status', 'active')->orderBy('order_no')->get();
        $experience = Experience::where('status', 'active')->orderBy('order_no')->get();
        $vehicle = Vehicle::where('status', 'active')->orderBy('order_no')->get();
        $job_skill = JobSkill::where('job_id', $job->id)->get();
        $country = Country::where('status', 'active')->orderBy('order_no')->get();
        $province = Province::where('status', 'active')->orderBy('order_no')->get();
        $district = District::where('status', 'active')->orderBy('order_no')->get();
        $city = City::where('status', 'active')->orderBy('order_no')->get();
        $vehicle = Vehicle::where('status', 'active')->orderBy('order_no')->get();
        $license = License::where('job_id', $job->id)->get();
        $employeeType = EmployeeType::where('status', 'active')->orderBy('order_no')->get();
        $skill = Skill::where('status', 'active')->orderBy('order_no')->get();